src/Catalogs/ГрафыБюджета/ГрафыБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГрафыБюджета</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВозвратВыданногоЗайма</name>
      <description>Возврат выданного займа</description>
    </items>
    <items>
      <name>ФинЦельВозвратИзНакопления</name>
      <description>Возврат из накопления (-)</description>
    </items>
    <items>
      <name>СвободныеДеньгиВозвратИзНакопления</name>
      <description>Возврат из накопления (+)</description>
    </items>
    <items>
      <name>ВыдачаВзаймы</name>
      <description>Выдача взаймы</description>
    </items>
    <items>
      <name>ВыручкаЗаИмущество</name>
      <description>Выручка за имущество</description>
    </items>
    <items>
      <name>Доходы</name>
      <description>Доходы (+)</description>
    </items>
    <items>
      <name>ИспользованиеКредитнойКарты</name>
      <description>Оплата кредиткой</description>
    </items>
    <items>
      <name>СвободныеДеньгиПереводВНакопление</name>
      <description>Перевод в накопление (-)</description>
    </items>
    <items>
      <name>ФинЦельПереводВНакопление</name>
      <description>Перевод в накопление (+)</description>
    </items>
    <items>
      <name>ПереводНаКредитнуюКарту</name>
      <description>Перевод на кредитную карту</description>
    </items>
    <items>
      <name>ПогашениеКредита</name>
      <description>Погашение кредита</description>
    </items>
    <items>
      <name>ПокупкаИмущества</name>
      <description>Покупка имущества</description>
    </items>
    <items>
      <name>ПолучениеКредита</name>
      <description>Получение кредита</description>
    </items>
    <items>
      <name>ПрочиеДоходы</name>
      <description>Прочие доходы (+)</description>
    </items>
    <items>
      <name>ПрочиеРасходы</name>
      <description>Прочие расходы (-)</description>
    </items>
    <items>
      <name>Расходы</name>
      <description>Расходы (-)</description>
    </items>
  </predefined>
  <attributes>
    <name>ДляФинансовыхЦелей</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляСвободныхДенег</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.ТипыБюджетныхПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСтатьи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтношениеКНакоплениям</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыБюджетныхПоказателей/ТипыБюджетныхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыБюджетныхПоказателей</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ГрафыБюджета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устаналивает значения по умолчанию для реквизитов предопределенных элементов справочника
//	
Процедура ОбновитьРеквизитыПредопределенныхЭлементов() Экспорт

	// Справочник "ГрафыБюджета" используется для упорядочивания статей бюджета.
	//	Предопределенные элементы должны по умолчанию иметь однозначные коды, т.к. именно по ним 
	//	сворачиваются показатели бюджета.
	
	// Доходы:
	ТипПоказателя = Перечисления.ТипыБюджетныхПоказателей.Поступление;
	
	// "Прочие доходы" имеет код "10." - корень для всех планируемых поступлений
	//	Если для бюджетной статьи дохода не найдется родителя с более длинным кодом, 
	//	такая статья автоматически попадет в "Прочие доходы"
	Графа = Справочники.ГрафыБюджета.ПрочиеДоходы.ПолучитьОбъект();
	Графа.Наименование = НСтр("ru = 'Другие доходы'");
	Графа.Код                      = "10.99.";
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 9999;
	Графа.ТипСтатьи                = "ВсеДоходы";
	Графа.ОтношениеКНакоплениям    = 0;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.ДляСвободныхДенег        = Истина;
	Графа.Записать();
	
	
	Графа = Справочники.ГрафыБюджета.Доходы.ПолучитьОбъект();
	Графа.Наименование = НСтр("ru = 'Доходы по статьям'");
	Графа.Код                      = "10.1.";
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1100;
	Графа.ТипСтатьи                = "СтатьяДоходов";
	Графа.ОтношениеКНакоплениям    = 0;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.ДляСвободныхДенег        = Истина;
	Графа.Записать();
	
	
	// Только для свободных денег: возврат из накоплений в свободные деньги
	Графа = Справочники.ГрафыБюджета.СвободныеДеньгиВозвратИзНакопления.ПолучитьОбъект();
	Графа.Наименование = НСтр("ru = 'Перевод из накоплений'");
	Графа.Код                      = "10.2.";
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1200;
	Графа.ТипСтатьи                = "Финцель";
	Графа.ОтношениеКНакоплениям    = -1;
	Графа.ДляФинансовыхЦелей       = Ложь;
	Графа.ДляСвободныхДенег        = Истина;
	Графа.Записать();
	
	Графа = Справочники.ГрафыБюджета.ИспользованиеКредитнойКарты.ПолучитьОбъект();
	Графа.Наименование = НСтр("ru = 'Использование кредитных карт'");
	Графа.Код                      = "10.3.";
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1300;
	Графа.ТипСтатьи                = "КредитнаяКарта";
	Графа.ОтношениеКНакоплениям    = 0;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.ДляСвободныхДенег        = Истина;
	Графа.Записать();
	
	
	Графа = Справочники.ГрафыБюджета.ПолучениеКредита.ПолучитьОбъект();
	Графа.Наименование = НСтр("ru = 'Получение кредитов, займов'");
	Графа.Код                      = "10.4.";
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1400;
	Графа.ТипСтатьи                = "НашДолг";
	Графа.ОтношениеКНакоплениям    = 0;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.ДляСвободныхДенег        = Истина;
	Графа.Записать();
	
	
	Графа = Справочники.ГрафыБюджета.ВозвратВыданногоЗайма.ПолучитьОбъект();
	Графа.Наименование = НСтр("ru = 'Возврат от должников'");
	Графа.Код                      = "10.5.";
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1500;
	Графа.ТипСтатьи                = "ДолгНам";
	Графа.ОтношениеКНакоплениям    = 0;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.ДляСвободныхДенег        = Истина;
	Графа.Записать();
	
	
	Графа = Справочники.ГрафыБюджета.ВыручкаЗаИмущество.ПолучитьОбъект();
	Графа.Наименование = НСтр("ru = 'Продажа имущества'");
	Графа.Код                      = "10.6.";
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1600;
	Графа.ТипСтатьи                = "Имущество";
	Графа.ОтношениеКНакоплениям    = 0;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.ДляСвободныхДенег        = Истина;
	Графа.Записать();
	
	
	
	// Только для накоплений: поревод в накопление на фин.цель из св. денег или др. накоплений
	Графа = Справочники.ГрафыБюджета.ФинЦельПереводВНакопление.ПолучитьОбъект();
	Графа.Наименование = НСтр("ru = 'Поступления из свободных денег или др. фин.целей'");
	Графа.Код                      = "10.7.";
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1100;
	Графа.ТипСтатьи                = "Финцель";
	Графа.ОтношениеКНакоплениям    = 1;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.ДляСвободныхДенег        = Ложь;
	Графа.Записать();
	
	
	
	// Рахсоды
	ТипПоказателя = Перечисления.ТипыБюджетныхПоказателей.Списание;
	
	// "Прочие расходы" имеет код "20." - корень для всех планируемых списаний.
	//	Если для бюджетной статьи расходв не найдется родителя с более длинным кодом, 
	//	такая статья автоматически попадет в "Прочие расходы"
	Графа = Справочники.ГрафыБюджета.ПрочиеРасходы.ПолучитьОбъект();
	Графа.Наименование = НСтр("ru = 'Другие расходы'");
	Графа.Код                      = "20.99.";
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 9999;
	Графа.ТипСтатьи                = "ВсеРасходы";
	Графа.ОтношениеКНакоплениям    = 0;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.ДляСвободныхДенег        = Истина;
	Графа.Записать();
	
	
	Графа = Справочники.ГрафыБюджета.Расходы.ПолучитьОбъект();
	Графа.Наименование = НСтр("ru = 'Расходы по статьям'");
	Графа.Код                      = "20.1.";
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1100;
	Графа.ТипСтатьи                = "СтатьяРасходов";
	Графа.ОтношениеКНакоплениям    = 0;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.ДляСвободныхДенег        = Истина;
	Графа.Записать();
	
	// Только для свободных денег: перевод в накопления
	Графа = Справочники.ГрафыБюджета.СвободныеДеньгиПереводВНакопление.ПолучитьОбъект();
	Графа.Наименование = НСтр("ru = 'Перевод в накопления'");
	Графа.Код                      = "20.2.";
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1200;
	Графа.ТипСтатьи                = "Финцель";
	Графа.ОтношениеКНакоплениям    = -1;
	Графа.ДляФинансовыхЦелей       = Ложь;
	Графа.ДляСвободныхДенег        = Истина;
	Графа.Записать();
	
	Графа = Справочники.ГрафыБюджета.ПереводНаКредитнуюКарту.ПолучитьОбъект();
	Графа.Наименование = НСтр("ru = 'Пополнение кредитных карт'");
	Графа.Код                      = "20.3.";
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1300;
	Графа.ТипСтатьи                = "КредитнаяКарта";
	Графа.ОтношениеКНакоплениям    = 0;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.ДляСвободныхДенег        = Истина;
	Графа.Записать();
	
	
	Графа = Справочники.ГрафыБюджета.ПогашениеКредита.ПолучитьОбъект();
	Графа.Наименование = НСтр("ru = 'Погашение кредитов, займов'");
	Графа.Код                      = "20.4.";
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1400;
	Графа.ТипСтатьи                = "НашДолг";
	Графа.ОтношениеКНакоплениям    = 0;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.ДляСвободныхДенег        = Истина;
	Графа.Записать();
	
	Графа = Справочники.ГрафыБюджета.ВыдачаВзаймы.ПолучитьОбъект();
	Графа.Наименование = НСтр("ru = 'Выдача в долг'");
	Графа.Код                      = "20.5.";
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1500;
	Графа.ТипСтатьи                = "ДолгНам";
	Графа.ОтношениеКНакоплениям    = 0;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.ДляСвободныхДенег        = Истина;
	Графа.Записать();
	
	
	Графа = Справочники.ГрафыБюджета.ПокупкаИмущества.ПолучитьОбъект();
	Графа.Наименование = НСтр("ru = 'Покупка имущества'");
	Графа.Код                      = "20.6.";
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1600;
	Графа.ТипСтатьи                = "Имущество";
	Графа.ОтношениеКНакоплениям    = 0;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.ДляСвободныхДенег        = Истина;
	Графа.Записать();
	
	
	// Только для накоплений: перевод из накоплений в свободные деньги или на другую фин.цель
	Графа = Справочники.ГрафыБюджета.ФинЦельВозвратИзНакопления.ПолучитьОбъект();
	Графа.Наименование = НСтр("ru = 'Перевод в св. деньги или на другую фин.цель'");
	Графа.Код                      = "20.7.";
	Графа.Родитель                 = Справочники.ГрафыБюджета.ПустаяСсылка();
	Графа.ТипПоказателя            = ТипПоказателя;
	Графа.ПорядокПоУмолчанию       = 1150;
	Графа.ТипСтатьи                = "Финцель";
	Графа.ОтношениеКНакоплениям    = 1;
	Графа.ДляФинансовыхЦелей       = Истина;
	Графа.ДляСвободныхДенег        = Ложь;
	Графа.Записать();
	
	УзлыОбмена = ПланыОбмена.МобильноеПриложение.ПолучитьИспользуемыеУзлыПланаОбмена();
	Если УзлыОбмена.Количество() > 0 Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Отбор") Тогда
		Параметры.Вставить("Отбор", Новый Структура);
	КонецЕсли;
	
	Если Не Параметры.Отбор.Свойство("ПометкаУдаления") Тогда
		Параметры.Отбор.Вставить("ПометкаУдаления", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
